In [1]:
import pandas as pd
import numpy as np

In [2]:
datas = pd.date_range('20210101',periods=12)
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12'],
              dtype='datetime64[ns]', freq='D')

In [3]:
nomes = ['Gustavo', 'Joice', 'Xita']
nomes

['Gustavo', 'Joice', 'Xita']

In [9]:
np.random.choice(nomes)

'Xita'

In [29]:
np.random.rand()*100

48.524446983067826

In [33]:
nome = []
valor = []
for i in range(12):
    nome.append(np.random.choice(nomes))
    valor.append(np.round( np.random.rand()*100, decimals=2))

In [34]:
nome

['Xita',
 'Gustavo',
 'Joice',
 'Gustavo',
 'Gustavo',
 'Gustavo',
 'Xita',
 'Gustavo',
 'Gustavo',
 'Joice',
 'Joice',
 'Gustavo']

In [35]:
valor

[2.77,
 89.39,
 29.08,
 4.58,
 11.1,
 46.68,
 92.95,
 85.95,
 73.72,
 41.73,
 67.93,
 89.14]

In [39]:
df = pd.DataFrame({'dia': datas, 'cliente': nome, 'valor': valor})
df

          dia  cliente  valor
0  2021-01-01     Xita   2.77
1  2021-01-02  Gustavo  89.39
2  2021-01-03    Joice  29.08
3  2021-01-04  Gustavo   4.58
4  2021-01-05  Gustavo  11.10
5  2021-01-06  Gustavo  46.68
6  2021-01-07     Xita  92.95
7  2021-01-08  Gustavo  85.95
8  2021-01-09  Gustavo  73.72
9  2021-01-10    Joice  41.73
10 2021-01-11    Joice  67.93
11 2021-01-12  Gustavo  89.14

In [42]:
df.groupby('cliente').sum()

          valor
cliente
Gustavo  400.56
Joice    138.74
Xita      95.72